//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//int main()
//{
//	int arr1[3][4] = { {1,2,3,4},{5,6,7,8},{1,2,3,4} };
//	// 3行4列的数组
//	int arr2[3][4] = { 1,2,3,4,5,6,7,8,1,2,3,4 };
//	//依旧是3行4列的数组
//	int arr3[3][4] = { 1,2,3,4,5,6,7,8,1,2 };
//	//3行4列的数组，不够的补0
//	int arr4[3][4] = { {1,2},{3,4},{5,6} };
//	//3行4列，不够的补0
//	int arr5[][4] = { {1,2,3,4},{1,2} };
//	int arr6[][4] = { 1,2,3,4,1,2 };
//	//二维数组只能省略行，不能省略列
//
//	//二维数组在内存中是连续存放的
//
//
//	//遍历二维数组
//	int arr7[3][4] = { {1,2,3,4},{5,6,7,8},{1,2,3,4} };
//	int i = 0;
//	for (i = 0; i < 3; i++)
//	{
//		int j = 0;
//		for (j = 0; j < 4; j++)
//		{
//			//printf("%d", arr7[i][j]);
//			//scanf("%d",&arr7[i][j]);  遍历输入
//			printf("&arr7[%d][%d]=%p\n", i, j, &arr7[i][j]);//遍历地址，打印地址用%p
//
//		}
//		printf("\n");
//	}
//	return 0;
//}